In [3]:
import pandas as pd

In [12]:
# Two important datastructures in python 
# 1. Series => column of a dataframe
values = [10, 20, 30, 40, 50]
s = pd.Series(values, index=['a', 'b', 'c', 'd', 'e'])

s.loc['a']   # access based on thier index

# 2. Data Frame => combination of excel and database, collection of series
df = pd.DataFrame({
    'name': ['Mike', 'Bob', 'Alice'],
    'age': [30,80,45],
    'job': ['Programmer', 'Clerk', 'Designer']
})

df = df.set_index('name')

In [15]:
df

       age         job
name
Mike    30  Programmer
Bob     80       Clerk
Alice   45    Designer

In [18]:
df1 = pd.DataFrame({
    'a': [1,2,3],
}, index=[0,1,2])

df2 = pd.DataFrame({
    'a' :[10,11,12]
}, index = [1,2,0])

In [ ]:
df1 + df2 # they have same index i.e. why they were added

    a
0  11
1  13
2  15

In [ ]:
df1 + df2 # they add acc to thier index value

    a
0  13
1  12
2  14

In [23]:
df =df.reset_index()
df

   index   name  age         job
0      0   Mike   30  Programmer
1      1    Bob   80       Clerk
2      2  Alice   45    Designer

In [28]:
df.to_csv('mydata.csv', index = None)

In [32]:
pd.read_csv('mydata.csv', index_col=0)

        name  age         job
index
0       Mike   30  Programmer
1        Bob   80       Clerk
2      Alice   45    Designer

In [33]:
df.to_json('mydata.json')

In [34]:
df.to_dict()

{'index': {0: 0, 1: 1, 2: 2},
 'name': {0: 'Mike', 1: 'Bob', 2: 'Alice'},
 'age': {0: 30, 1: 80, 2: 45},
 'job': {0: 'Programmer', 1: 'Clerk', 2: 'Designer'}}